greetings = {
    "ياهلا": [
        "يا مرحبًا ومسهّلًا! الجو عندي صار أحلى 😎",
        "هلا بك أكثر! شلونك؟",
        "نورت المكان، بس أهم شي، جايب أخبار حلوة؟ 😏"
    ],
    "اهلا": [
        "يا مرحبًا ومسهّلًا! الجو عندي صار أحلى 😎",
        "هلا بك أكثر! شلونك؟",
        "نورت المكان، بس أهم شي، جايب أخبار حلوة؟ 😏"
    ],
    "مرحبا": [
        "يا حيّ الله من جانا! وش العلوم؟ 🌟",
        "مرحب مليون، منور المكان! كيفك؟"
    ],
    "يامرحبا": [
        "يا حيّ الله من جانا! وش العلوم؟ 🌟",
        "مرحب مليون، منور المكان! كيفك؟"
    ],
    "يمرحبا": [
        "يا حيّ الله من جانا! وش العلوم؟ 🌟",
        "مرحب مليون، منور المكان! كيفك؟"
    ],
    "السلام عليكم": [
        "وعليكم السلام ورحمة الله وبركاته، كيف الحال يا نجم؟ ✨",
        "وعليكم السلام، المكان نور بوجودك!",
        "وعليكم السلام ورحمة الله وبركاته، عسى يومك طيب؟"
    ],
    "السلام عليكم ورحمة الله": [
        "وعليكم السلام ورحمة الله وبركاته، كيف الحال يا نجم؟ ✨",
        "وعليكم السلام، المكان نور بوجودك!",
        "وعليكم السلام ورحمة الله وبركاته، عسى يومك طيب؟"
    ],
    "السلام عليكم ورحمة الله وبركاته": [
        "وعليكم السلام ورحمة الله وبركاته، كيف الحال يا نجم؟ ✨",
        "وعليكم السلام، المكان نور بوجودك!",
        "وعليكم السلام ورحمة الله وبركاته، عسى يومك طيب؟"
    ],
    "عيد مبارك": [
        "عيدك مبارك، وعساك من عواده! 🎉 وش خططك للعيد؟ 😏",
        "تقبل الله منا ومنك، عيد سعيد عليك وعلى أحبابك! 🎊",
        "كل عام وأنت بخير، جعل أيامك كلها فرح وسعادة! 💛"
    ],
    "كل عام وأنت بخير": [
        "عيدك مبارك، وعساك من عواده! 🎉 وش خططك للعيد؟ 😏",
        "تقبل الله منا ومنك، عيد سعيد عليك وعلى أحبابك! 🎊",
        "كل عام وأنت بخير، جعل أيامك كلها فرح وسعادة! 💛"
    ],
    "كيفك؟": [
        "الحمد لله 🙏🏻، أنت شلونك؟ وش العلوم؟",
        "عايش بين الكود والقهوة، وأنت؟ 🤯☕",
        "لو سألتني قبل خمس دقايق كان الجواب غير، بس الحين تمام! 😂"
    ],
    "مين معايا؟": [
        "معاك اللي دايمًا موجود، بس أهم شي… انت مين؟ 👀",
        "أهم سؤال! بس أنت وش تتوقع؟ 🤔",
    ]
}